# This file should contain all the record creation needed to seed the database with its default values.
# The data can then be loaded with the rake db:seed (or create!d alongside the db with db:setup).
#
# Examples:
#
#   cities = City.create!([{ name: 'Chicago' }, { name: 'Copenhagen' }])
#   Mayor.create!(name: 'Emanuel', city: cities.first)

m= Masecet.create!(name: "ברכות")

d= m.dafs.create!(daf_num: 0, perek: 0)

para= d.paragraphs.create!( 
  title: "משנה", 
  content:
    "מאימתי קורין את שמע בערבין. משעה שהכהנים נכנסים לאכול בתרומתן עד סוף האשמורה הראשונה דברי ר' אליעזר. וחכמים אומרים עד חצות. רבן גמליאל אומר עד שיעלה עמוד השחר. מעשה ובאו בניו מבית המשתה אמרו לו לא קרינו את שמע אמר להם אם לא עלה עמוד השחר חייבין אתם לקרות ולא זו בלבד אמרו אלא כל מה שאמרו חכמים עד חצות מצותן עד שיעלה עמוד השחר הקטר חלבים ואברים מצותן עד שיעלה עמוד השחר וכל הנאכלים ליום אחד מצותן עד שיעלה עמוד השחר א''כ למה אמרו חכמים עד חצות כדי להרחיק אדם מן העבירה:",
  order: 0
)

#para= Paragraph.first

[
  ["מאימתי קורין את שמע בערבין"," משעה שהכהנים נכנסים לאכול בתרומתן. כהנים שנטמאו וטבלו והעריב שמשן והגיע עתם לאכול בתרומה",9],
  [" עד סוף האשמורה הראשונה"," שליש הלילה כדמפרש בגמ' (דף ג ע''א) ומשם ואילך עבר זמן דלא מקרי תו זמן שכיבה ולא קרינן ביה בשכבך ומקמי הכי נמי לאו זמן שכיבה לפיכך הקורא קודם לכן לא יצא ידי חובתו. אם כן למה קורין אותה בבית הכנסת כדי לעמוד בתפלה מתוך דברי תורה והכי תניא בבריי' בברכות ירושלמי. ולפיכך חובה עלינו לקרותה משתחשך. ובקריאת פרשה ראשונה שאדם קורא על מטתו יצא",70],
  [" עד שיעלה עמוד השחר"," שכל הלילה קרוי זמן שכיבה",148],
  [" הקטר חלבים ואברים"," של קרבנות שנזרק דמן ביום",335],
  [" מצותן"," להעלות כל הלילה ואינן נפסלים בלינה עד שיעלה עמוד השחר והן למטה מן המזבח דכתי' לא ילין לבקר (שמות לד)",353],
  [" חלבים"," של כל קרבנות",353],
  [" אברים"," של עולה",353],
  [" וכל הנאכלים ליום אחד"," כגון חטאת ואשם וכבשי עצרת ומנחות ותודה",378],
  [" מצותן"," זמן אכילתן",399],
  [" עד שיעלה עמוד השחר"," והוא מביאן להיות נותר דכתיב בתודה לא יניח ממנו עד בקר (ויקרא ז) וכלם מתודה ילמדו",405],
  [" אם כן למה אמרו חכמים עד חצות"," בקריאת שמע ובאכילת קדשי'",405],
  [" כדי להרחיק אדם מן העבירה"," ואסרום באכילה קודם זמנן כדי שלא יבא לאכלן לאחר עמוד השחר ויתחייב כרת וכן בקריאת שמע לזרז את האדם שלא יאמר יש לי עוד שהות ובתוך כך יעלה עמוד השחר ועבר לו הזמן. והקטר חלבים דקתני הכא לא אמרו בו חכמים עד חצות כלל ולא נקט להו הכא אלא להודיע שכל דבר הנוהג בלילה כשר כל הלילה. והכי נמי תנן בפרק שני דמגילה (דף כ ע''ב) כל הלילה כשר לקצירת העומר ולהקטר חלבים ואברים",452],
].each{ |(t,c,i)|
  para.pirushes.create!(type: "Rashi", title: t, content: c, index: i)
}

[
  ["מאימתי קורין"," פי' רש''י ואנן היכי קרינן מבעוד יום ואין אנו ממתינין לצאת הכוכבים כדמפרש בגמ' על כן פירש רש''י שקריאת שמע שעל המטה עיקר והוא לאחר צאת הכוכבים. והכי איתא בירושלמי אם קרא קודם לכן לא יצא ואם כן למה אנו מתפללין קריאת שמע בבית הכנסת כדי לעמוד בתפלה מתוך דברי תורה. תימא לפירושו והלא אין העולם רגילין לקרות סמוך לשכיבה אלא פרשה ראשונה (לקמן דף ס ע''ב) ואם כן שלש פרשיות היה לו לקרות. ועוד קשה דצריך לברך בקריאת שמע שתים לפניה ושתים לאחריה בערבית. ועוד דאותה קריאת שמע סמוך למטה אינה אלא בשביל המזיקין כדאמר בסמוך (דף ה ע''א) ואם תלמיד חכם הוא אינו צריך. ועוד קשה דא''כ פסקינן כרבי יהושע בן לוי דאמר תפלות באמצע תקנום פי' באמצע בין שני קריאת שמע בין קריאת שמע של שחרית ובין ק''ש של ערבית. ואנן קיי''ל כר' יוחנן דאמר לקמן (דף ד) איזהו בן העולם הבא זה הסומך גאולה של ערבית לתפלה. לכן פי' ר''ת דאדרבה קריאת שמע של בית הכנסת עיקר. ואם תאמר היאך אנו קורין כל כך מבעוד יום. ויש לומר דקיימא לן כרבי יהודה דאמר בפרק תפלת השחר (דף כו ע''א) דזמן תפלת מנחה עד פלג המנחה דהיינו אחד עשר שעות פחות רביע ומיד כשיכלה זמן המנחה מתחיל זמן ערבית. ואם תאמר היאך אנו מתפללין תפלת מנחה סמוך לחשכה ואפילו לאחר פלג המנחה. יש לומר דקיימא לן כרבנן דאמרי זמן תפלת המנחה עד הערב ואמרינן לקמן (דף כז ע''א) השתא דלא אתמר הלכתא לא כמר ולא כמר דעבד כמר עבד ודעבד כמר עבד. מכל מקום קשיא דהוי כתרי קולי דסתרן אהדדי שהרי מאיזה טעם אנו מתפללין ערבית מיד לאחר פלג המנחה משום דקיימא לן דשעת המנחה כלה כדברי רבי יהודה ומיד הוי זמן ערבית ובזמן התפלה עצמה לא קיימא לן כרבי יהודה אלא כרבנן. על כן אומר ר''י דודאי קריאת שמע של בית הכנסת עיקר ואנו שמתפללין ערבית מבעוד יום סבירא לן כהני תנאי דגמרא דאמרי משעה שקדש היום וגם משעה שבני אדם נכנסים להסב דהיינו סעודת ע''ש והיא היתה מבעוד יום ומאותה שעה הוי זמן תפלה. וגם ראיה (לקמן כז) דרב הוי מצלי של שבת בערב שבת ומסתמא גם היה קורא קריאת שמע. מכל אותן הראיות משמע דקריאת שמע של בית הכנסת היא עיקר. והא דקאמר בירושלמי למה היו קורין בבהכ''נ וכו' אומר ר''ת שהיו רגילין לקרות ק''ש קודם תפלתם כמו שאנו רגילין לומר אשרי תחלה ואותה ק''ש אינה אלא לעמוד בתפלה מתוך דברי תורה. ומכאן נראה מי שקורא ק''ש על מטתו שאין לברך וגם אינו צריך לקרות אלא פרשה ראשונה",9],
  [" ליתני דשחרית ברישא"," כדאשכחן בתמיד דכתיב של בקר תחלה",9],
  [" אי הכי סיפא דקתני שחרית ברישא"," אי אמרת בשלמא דסמיך אקרא דבשכבך א''כ אינו מקפיד קרא אלא אק''ש. אלא א''א דסמיך אקרא דברייתו של עולם א''כ קפיד אכל מילי א''כ סיפא דקתני וכו'",10],
].each{ |(t,c,i)|
  para.pirushes.create!(type: "Tosfot", title: t, content: c, index: i)
}